test/tests/fixed-point/restart_heated_plate/fluid-openfoam/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
12013
(
103500.011413881
103500.011413881
103500.011413881
103500.011413881
103500.011413881
103500.011413881
103500.011413881
103500.011413881
...
)
;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 103500;
    }
    top
    {
        type            zeroGradient;
    }
    slip-bottom
    {
        type            zeroGradient;
    }
    bottom
    {
        type            zeroGradient;
    }
    interface
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
